Repository: abdalla-hassanin/Roshetta-Pro
Catalog: lib/core/l10n/app_*.arb
Languages: ar

source: Roshetta Pro
ar: روشتة برو

source: This Field Must Be Filled
ar: يجب ملء هذه الخانه

source: Email Address
ar: البريد الألكتروني

source: Welcome Back!
ar: مرحبا بعودتك!

source: Login to Roshetta Pro
ar: تسجيل الدخول للروشتة برو

source: Forget Your Password
ar: نسيت كلمه المرور

source: Or Sign In with
ar: أو قم بتسجيل الدخول باستخدام

source: Sign Up
ar: أشتراك

source: User Name
ar: اسم المستخدم

source: User Address
ar: عنوان المستخدم

# userNationalId
source: National ID
ar: الرقم القومي

# writeYourBio
source: Write your own bio...
ar: عرف نفسك...

source: Register
ar: أنشأ حساب

source: Sign In
ar: تسجيل الدخول

# createToRoshettaPro
source: Create a new Account to Roshetta Pro
ar: قم بأنشاء حساب جديد للروشتة برو

source: Enter the email address associated with your account
ar: أدخل عنوان البريد الإلكتروني المرتبط بحسابك

source: Specialization
ar: التخصص

source: Birth Day
ar: تاريخ الميلاد

# isThereDelivery
source: Is there home delivery?
ar: هل يوجد توصيل للمنازل؟

source: Register As
ar: إنشا حساب كا

source: Create Account Doctor
ar: إنشاء حساب طبيب

source: Create Account Pharmacy
ar: إنشاء حساب الصيدلية

source: Create Account Patient
ar: إنشاء حساب مريض

source: Name
ar: الاسم

source: Quatrain Name
ar: الاسم الرباعي

source: Email
ar: البريد الالكتروني

source: Password
ar: كلمة المرور

source: Number Phone
ar: رقم الهاتف

source: Address
ar: العنوان

source: About your CV
ar: نبذة عن سيرتك الذاتية

source: About you ...
ar: نبذة عنك ...

source: Hospital Name
ar: اسم المستشفى

source: Clinic Name
ar: اسم العيادة

source: Pharmacy Name
ar: اسم العيادة

source: Medical Specialty
ar: التخصص الطبي

# chooseSpecialty
source: Choose a Specialty
ar: اختر التخصص

source: Create Account
ar: إنشاء حساب

source: Already have an Account ?
ar: لديك حساب بالفعل ؟

source: Login
ar: تسجيل الدخول

# doNotHaveAnAccount
source: Don't have an account ?
ar: ليس لديك حساب ؟

source: Gender
ar: الجنس

source: Male
ar: ذكر

source: Female
ar: أنثى

source: Blood
ar: نوع الدم

# height
source: Height (cm)
ar: الطول (سم)

# weight
source: Weight (kg)
ar: الوزن (كلغ)

source: Doctor
ar: طبيب

source: Patient
ar: مريض

source: Pharmacy
ar: صيدلية

# signOutFromAccount
source: Do you want to sign out of the account?
ar: هل تريد تسجيل الخروج من الحساب ؟

# soon
source: Soon, God willing
ar: قريباً أن شاء الله

# changeLanguage
source: Do you want to change the language to Arabic?
ar: هل تريد تغيير اللغة الى اللغة الانجليزية ؟

source: Prescriptions
ar: الروشتات

source: Alerts
ar: المنبهات

source: X-rays ,Analysis
ar: الإشاعات ,التحاليل

source: Medical History
ar: السجل الطبي

# enterPatientPhone
source: Please, enter the patient's phone number to access the patient panel
ar: من فضلك، أدخل رقم هاتف المريض لدخول الى لوحة المريض

# enterPatientPhonePrescriptionID
source: Please, enter the patient's phone number and prescription ID to access the patient panel
ar: من فضلك، أدخل رقم هاتف المريض ورقم الروشتة لدخول الى لوحة المريض

source: Settings
ar: الإعدادات

source: See your profile
ar: عرض ملفك الشخصي

source: Sign Out
ar: تسجيل الخروج

source: Account
ar: الحساب الشخصي

# personalInfo
source: Your Personal Info
ar: بياناتك الشخصيه

# changePassword
source: Reset Password
ar: أعادة تعيين كلمة السر

source: Notifications
ar: إشعارات

source: Notifications Control
ar: التحكم في الإشعارات

source: Language
ar: اللغة

source: Language Control
ar: التحكم في اللغة

source: Arabic
ar: عربي

source: Dark Mode
ar: الوضع الليلي

source: Lighting Control
ar: التحكم في الأضاءة

source: On
ar: تشغيل

source: Off
ar: ايقاف

source: Help
ar: المساعده

source: About Us
ar: معلومات عنا

# infoAboutUs
source: Information About Us
ar: معلومات عنا

source: Delete My Account
ar: حذف حسابي

source: Age
ar: العمر

source: Phone Number
ar: رقم المحمول

source: National ID
ar: الرقم الوطني

source: Edit Profile
ar: تعديل الملف الشخصي

source: My Profile
ar: ملفي الشخصي

source: Doctor Profile
ar: ملف الدكتور

source: Patient Profile
ar: ملف المريض

source: Number Drugs
ar: عدد الادوية

source: Work Days
ar: أيام العمل

source: Work Times
ar: وقت الأيام

# isDelivery
source: There is home delivery
ar: يوجد توصل للمنازل

# isNotDelivery
source: No home delivery
ar: لا يوجد توصل للمنازل

source: Home
ar: الرئيسية

source: Profile
ar: الملف الشخصي

source: More
ar: المزيد

source: My Dashboard
ar: لوحتي

source: Drugs
ar: أدوية

source: Notes
ar: ملاحظات

source: Prescription ID
ar: رقم الروشتة

source: Patient Dashboard
ar: لوحة المريض

source: Write Medical History
ar: اكتب تعليقاتك على هذا المريض...

source: New Medical History
ar: سجل طبي جديد

source: Save
ar: حفظ

# writeXRaysAnalyzes
source: Write your notes on X-rays ,Analysis...
ar: أكتب ملاحظاتك على الاشعة او التحليل ...

# newXRaysAnalyzes
source: New X-rays ,Analysis
ar: الإشاعات ,التحاليل الجديدة

source: Lab Name
ar: أسم المعمل

# closePatientDashboard
source: Was the session with the patient terminated ?
ar: هل تم إنهاء الجلسة مع المريض ؟

source: Yes
ar: نعم

source: No
ar: لا

source: Cancel
ar: إلغاء

source: Add
ar: إضافة

source: New Prescription
ar: روشتة جديدة

source: Days
ar: أيام

# durationUse
source: Duration of use
ar: مدة الاستخدام

# timeUse
source: Time of use
ar: وقت الاستخدام

source: Exit Patient Profile ??
ar: إنهاء حساب المريض ؟؟

source: Title
ar: العنوان

source: Write Title
ar: أكتب العنوان

source: Choose Image
ar: اختار الصورة

source: Exit Prescription ??
ar: إنهاء الروشتة بدون حفظ الروشتة ؟؟

source: Save Prescription ??
ar: حفظ الروشتة ؟؟

# noDrugsYet
source: No drugs have been added yet
ar: لا يوجد أدوية بعد

source: Add Drug
ar: إضافة دواء

# addXRay
source: Add X-ray, Analysis
ar: إضافة أشعة أو تحليل

source: Add Prescription
ar: إضافة روشتة

source: Add Medical History
ar: إضافة سجل طبي

source: Drug Name
ar: أسم الدواء

source: Drug Amount
ar: كمية الدواء

source: Drug Type
ar: نوع الدواء

source: How Long
ar: مدة الأستخدام

source: Time Of Use
ar: وقت الأستخدام

source: Confirm Exit
ar: تريد الإنهاء ؟؟

# sureExit
source: Are you sure you want to exit?
ar: هل أنت متاكد من أنك تريد الإنهاء ؟؟
